[[{"title": "Nice", "rating": "5.0 out of 5 stars", "body": "The quart size is kind of small"}, {"title": "Not good quality...", "rating": "2.0 out of 5 stars", "body": "You get what you pay for! Bottom of the small pot burned and ruined the the pot, just from boiling water."}, {"title": "Not made in the USA", "rating": "1.0 out of 5 stars", "body": "Returned the set. Prefer USA made."}, {"title": "They are perfect.", "rating": "5.0 out of 5 stars", "body": "I used these for my Duxtop . They are light weight and cook beautifully."}, {"title": "Great pans", "rating": "5.0 out of 5 stars", "body": "These pans were a good choice for our family.Pros, they are easy to clean and are staying pretty shiny.I haven’t found a con yet."}, {"title": "Pots!!", "rating": "5.0 out of 5 stars", "body": "Very nice SS pots with glass lids. I love them and will get plenty of use from them. Looking for pots, then start here."}, {"title": "Made in CHINA", "rating": "3.0 out of 5 stars", "body": "The advertisement made it look like they were made in Germany but it was not true."}, {"title": "Perfecto!", "rating": "5.0 out of 5 stars", "body": "Nothing to improve upon."}, {"title": "Great value for the price", "rating": "4.0 out of 5 stars", "body": "We needed something simple and inexpensive for our daughter's apartment. These fit the bill."}, {"title": "Love it! So glad I made this purchase! Worth every dime!", "rating": "5.0 out of 5 stars", "body": "Love it! So glad I made this purchase! Worth every dime!"}], [{"title": "No rust, very even cooking", "rating": "5.0 out of 5 stars", "body": "Solid pans. Handles are very meh but for the price weren't bad"}, {"title": "Me encanta", "rating": "5.0 out of 5 stars", "body": "Fácil de limpiar , buena presentación"}, {"title": "The cover conducts heat", "rating": "3.0 out of 5 stars", "body": "The pan is fine.The cover is badly designed - it gets hot so you can burn your hands. Other pan covers do not do this."}, {"title": "I love the long handles that do not heat up.", "rating": "5.0 out of 5 stars", "body": "The handles are a nice length and never heat up."}, {"title": "very sturdy", "rating": "5.0 out of 5 stars", "body": "long handles and sturdy in your hands"}, {"title": "Perfect size for cooking for 1 or2", "rating": "4.0 out of 5 stars", "body": "Small size is perfect for small meals. Surprisingly easy to clean"}, {"title": "Heavy duty", "rating": "4.0 out of 5 stars", "body": "Kind of a pain in the butt to clean"}, {"title": "I COOK NOW!?", "rating": "4.0 out of 5 stars", "body": "NICE kitchenware for a Bachelor to have, cooking for self finally, these pans definitely helps! ...Gratitude. 😁👍👍"}, {"title": "Very well constructed.", "rating": "5.0 out of 5 stars", "body": "I needed an induction compatible very small pot. Very well built and delivered rapidly."}, {"title": "Nice to look at & great value", "rating": "5.0 out of 5 stars", "body": "Nothing yet. I needed new sauce pans. Can’t wait to use them."}], [{"title": "Malas hollas", "rating": "1.0 out of 5 stars", "body": "Las peores hollas del mundo no voten el dinero. Se pega la comida desde la primera usada y se mancha de ka primera lavada."}, {"title": "Beautiful, I didn't need it but it sold itself - I'm keeping it.", "rating": "5.0 out of 5 stars", "body": "The heft is easy to manage while sturdy enough to take everyday use. Did I mention it's beautiful!"}, {"title": "heats evenly", "rating": "5.0 out of 5 stars", "body": "like the size perfect for two people and easy to clean"}, {"title": "Light weight.", "rating": "5.0 out of 5 stars", "body": "I like them. Just what I expected."}, {"title": "Great Buy", "rating": "5.0 out of 5 stars", "body": "Absolutely LOVE the pots!! Great quality, easy to wash great handle grip. Highly suggest to purchase!!"}, {"title": "They are ok", "rating": "4.0 out of 5 stars", "body": "The pots are light weight but do the job are a good product for the price."}, {"title": "Quality items - functions great / looks great !", "rating": "5.0 out of 5 stars", "body": "everyday - heating vegetables / like for dinner."}, {"title": "Good quality cookware. Do it!", "rating": "5.0 out of 5 stars", "body": "Good quality!"}, {"title": "Looks can be deceiving", "rating": "2.0 out of 5 stars", "body": "Looks very nice but even making a pot of boiled rice stained the bottom cannot get it clean btw did not burn the rice"}, {"title": "Nice quality", "rating": "5.0 out of 5 stars", "body": "It's perfect for cooking in."}], [{"title": "So nice!", "rating": "5.0 out of 5 stars", "body": "These pots are fantastic! The handles stay cool and have a nice feel. Everything cooks nicely. Love them!"}, {"title": "Real quality !", "rating": "5.0 out of 5 stars", "body": "These items are outstanding and clean very easily. First time cooking start off with low temperature because these pots are thin and neat quickly."}, {"title": "Average quality", "rating": "1.0 out of 5 stars", "body": "Average quality"}, {"title": "Great pots", "rating": "4.0 out of 5 stars", "body": "Love, love, love them"}, {"title": "cool handle", "rating": "3.0 out of 5 stars", "body": "So far so good. I like that the handle stays cool. Food sticks to the bottom but not too bad."}, {"title": "Well made", "rating": "5.0 out of 5 stars", "body": "Very well made, sturdy. Just the sizes I was looking for. Food doesn’t stick."}, {"title": "Nice lightweight almost perfect for me", "rating": "2.0 out of 5 stars", "body": "Update: had this for a couple of months. it’s starting to rust. This is not true stainless. Downgrading from 4 to 2 stars.Original:There is a trend for these small saucepans for heavier build. And i understand that this provide more even heating. However, my mother needed something more lightweight due to arthritis. These saucepans fit that perfectly in that they thick enough to be durable, but thin enough to remain lightweight. The only issue i see is that the lip is a bit too sharp. Most pots pans tend to have the edge nicely rounded and this you can feel like harsh corners of the edges. Other than that it's great."}, {"title": "A little lightweight, but good utility pots", "rating": "4.0 out of 5 stars", "body": "Got these for my mother who (bless her heart) has been using the same beat up saucepans with cheap nylon handles that she got as hand-me-downs from her G-G-G-G-G-G-G-Great grandma who I think got them from the lost colonists of Roanoke island who decided they'd rather run off than burn something with them again. Anyway... some thoughts:What we like:- Excellent heat transfer: She has coil burners, and there's typically a 'cool' spot in the middle of pan where the burner coils don't reach. These distribute well enough that we don't see that spot.- Long handles. Good for deep stoves and inserting into the oven.- Easy to clean. So far, even with minor scratches, the metal remains durable and with natural non-stick common to good quality stainless steelWhat we find lacking:- A little light: For mom they are good, she's a bit older. But for me, for the price point they seem a little on the thinner metal side, a little too lightweight.- Lid handles are obnoxious. They stick up so high as to limit stackability and tucking into the proofing drawer, and don't even try to hang them on the inside of lower cupboard doors.Overall, excellent to cook with, she likes them, and now she's insisting I get married and give her 11 generations of babies, grandbabies and such, so the family can use these until the year 2525. (If man is still alive)"}, {"title": "Good quality", "rating": "5.0 out of 5 stars", "body": "Everyday meal preparation, impressed with the quality for the price."}, {"title": "Easy to clean", "rating": "5.0 out of 5 stars", "body": "Nice saucepans to add size variety to cooking."}], [{"title": "Live these!", "rating": "5.0 out of 5 stars", "body": "Switched from non stick pots and pans and bought this option to try. You will not get better for the price!! Heats quickly and any discoloration comes off easily! For stuck on messes I just boiled some baking soda, vinegar and water and good as new!"}, {"title": "Great sauce pans", "rating": "5.0 out of 5 stars", "body": "Two very nice sauce pans for my new induction stove."}, {"title": "Nice quality and easy to clean", "rating": "5.0 out of 5 stars", "body": "Nice quality and easy to clean"}, {"title": "They'll do the trick for now.", "rating": "3.0 out of 5 stars", "body": "Bought these in the mean time because my wife and I have our eyes on more expensive ones. First impression was that they are thin and light. That pretty much tells me they used thin metal but that's what I paid for right. They are working well for us now. Haven't had any staining yet but this is a fresh review. We'll see long term how they perform."}, {"title": "Great product", "rating": "5.0 out of 5 stars", "body": "These pots replaced pans I had for over 20 years: Quality is wonderful. Will no doubt be good for a very long time"}, {"title": "Great sauce pans!", "rating": "5.0 out of 5 stars", "body": "These two lovely stainless steel pans with lids that are great for makes sauces, gravies, or a small side. They clean up easy and have a nice weight to them. The have the 3 ply clad stainless bottoms that work great for even cooking! I love That they are oven safe and can be used on mostly all cooking platforms to include induction!"}, {"title": "True to description", "rating": "5.0 out of 5 stars", "body": "True to description very easy to clean handle doesn’t get hot stuff doesn’t attach to the bottom it’s durable and dishwasher safe I really like it perfect size also"}, {"title": "Excellent quality, performance, and design.", "rating": "5.0 out of 5 stars", "body": "I have been using my Instant Pot for a LOT of things in the past year, and got away from stovetop cooking, but I LOVE these saucepans. The quality is outstanding, they heat up quickly, the vented lid's top handle is designed for a 'cool to the touch' grab, the long-ish handles stay cool, the rims are flanged for no-drip pouring, and they're sturdy stainless steel. I have other saucepans, but they all have non-stick finishes, and I prefer the clean, 'no chemicals' approach these days. I've been using these almost daily for 2 weeks, for everything from oatmeal to soups, pasta, and sauces and gravies. They might require a little more work than non-stick cookware when it comes time for cleanup, but the steel is of such good quality, that they've been cleaning up like brand new every time. I use Barkeeper's friend on my Instant Pot liner to keep it looking new, and the same goes for these. I did a variety of cheese and cream sauces in these for Thanksgiving, and they didn't require steel wool soap pads for cleaning. I've been the chef of the house for 40+ years, and I have Calphalon, Tramontina, Swiss Diamond, All-Clad, et al, and the quality of these is on an even par, if not better than some. I'm loving using these, because they're sized right for small dishes, and they also don't take up a lot of room on my 5-burner cooktop. I'm really pleased with the performance and quality of these."}, {"title": "Great value", "rating": "5.0 out of 5 stars", "body": "Easy to clean it wipes out food easily. The pots are perfect size for different meals. Well made and not heavy."}, {"title": "Absolutely Wonderful", "rating": "5.0 out of 5 stars", "body": "Stainless pots are wonderful especially with the clad bottom. One and Two quart sizes make them extremely versatile for most kitchens. Clean up after use is just as easy, too. Heat transfer was quick bringing food to temp faster than other flat bottom pots. Nice!"}]]